rails_klmtracks/app/controllers/commissions_controller.rb

  def index
    #@commissions = Commission.find(:all, :conditions => { :forday => , takenon => , amount => , employee_id=> })
    # :conditions => [ "BETWEEN ? AND ?", from, to]
    @ncommission = Commission.new
    @listOfEmployees = Employee.find(:all)
---
SELECT * FROM `employees` WHERE (`employees`.`id` = 1)

  def create
    @ncommission = Commission.new(params[:commission])
    if @ncommission.save
---
INSERT INTO `commissions` (`created_at`, `updated_at`, `amount`, `employee_id`, `forday`, `takenon`) VALUES('2010-06-28 05:23:42', '2010-06-28 05:23:42', 100, 1, '2010-06-01', NULL)