rails_klmtracks/app/controllers/employees_controller.rb

  def create
    @nemployee = Employee.new(params[:employee])
    @listOfDepartments = Department.find(:all)
    @listOfLocations = Location.find(:all)
    if @nemployee.save
---
INSERT INTO `employees` (`created_at`, `crypted_password`, `updated_at`, `username`, `fullname`, `password_salt`, `empid`, `persistence_token`, `location_id`, `email`, `department_id`) VALUES('2010-06-28 03:21:16', '27b43aeb5f06bd8fa380e0d2f9e969bb9717036b8378caa7546bf6e8775dbfb28183e17233f8571bdfa6115887d59902563f9b663acfc766c104ab5d31a400fd', '2010-06-28 03:21:16', 'Chandu', 'Chandu Nannapaneni', 'ZbY1Dn1tJiI_04N1lL2O', '1044', 'c77c15fae80d235f6f78518674d4484cc8cd027b9657d19121a38493e9e7b66101f090b726c8ff935db5689892df7365b137a5f168cc2bf4c2c6872ba3229e74', 3, 'paripurnachand@gmail.com', 2)

  def edit
    @employee = Employee.find(params[:id])
---
SELECT * FROM `employees` WHERE (`employees`.`id` = 1)

  def update
    @employee = Employee.find(params[:id])
    @listOfDepartments = Department.find(:all)
    @listOfLocations = Location.find(:all)

    if @employee.update_attributes(params[:employee])
---
SELECT * FROM `employees` WHERE (`employees`.`id` = 1)
UPDATE `employees` SET `updated_at` = '2010-06-28 03:48:20', `department_id` = 2, `location_id` = 4, `empid` = '1044' WHERE `id` = 1