rails_klmtracks/app/controllers/locations_controller.rb

INSERT INTO `locations` (`name`, `created_at`, `updated_at`, `state`) VALUES(NULL, '2010-06-27 11:06:16', '2010-06-27 11:06:16', NULL)
---
  def create
    @location = Location.new(params[:location])
    if @location.save