rails_klmtracks/app/controllers/managedivisions_controller.rb

INSERT INTO `divisions` (`name`, `created_at`, `updated_at`) VALUES('LADIES', '2010-06-27 12:44:29', '2010-06-27 12:44:29')
---
  def create_division
    @ndivision = Division.new(params[:division])
    if @ndivision.save

INSERT INTO `sections` (`name`, `created_at`, `updated_at`, `division_id`) VALUES('ETHNIC WEAR', '2010-06-28 02:19:24', '2010-06-28 02:19:24', 2)
---
  def create_section
    @nsection = Section.new(params[:section])
    if @nsection.save

INSERT INTO `departments` (`name`, `created_at`, `section_id`, `updated_at`) VALUES('KURTAS', '2010-06-28 02:19:53', NULL, '2010-06-28 02:19:53')
---
  def create_department
    @nDepartment = Department.new(params[:department])
    if @nDepartment.save

SELECT * FROM `divisions` WHERE (`divisions`.`id` = 2)
SELECT * FROM `sections` WHERE (`sections`.division_id = 2)
---
  def getListOfSections
    render :update do |page|
          @sectionsInThisDiv = Division.find( params[:divid] ).sections