sodexo/app/controllers/buyers_controller.rb

  def index
    @buyers = Buyer.all
---
SELECT * FROM `buyers`

  def show
    @buyer = Buyer.find(params[:id])
---
SELECT * FROM `buyers` WHERE (`buyers`.`id` = 1)

  def edit
    @buyer = Buyer.find(params[:id])
---
SELECT * FROM `buyers` WHERE (`buyers`.`id` = 1)

  def create
    @buyer = Buyer.new(params[:buyer])

    respond_to do |format|
      if @buyer.save
---
INSERT INTO `buyers` (`name`, `address`, `created_at`, `updated_at`, `phone1`, `phone2`, `isActive`) VALUES('Taaza', 'my office', '2010-07-14 17:02:06', '2010-07-14 17:02:06', '981111198', '', 1)

  def update
    @buyer = Buyer.find(params[:id])

    respond_to do |format|
      if @buyer.update_attributes(params[:buyer])
---
SELECT * FROM `buyers` WHERE (`buyers`.`id` = 1)
UPDATE `buyers` SET `updated_at` = '2010-07-14 21:09:09', `phone2` = '0345678' WHERE `id` = 1