sodexo/app/controllers/coupon_prices_controller.rb

  def index
    @coupon_prices = CouponPrice.all
---
SELECT * FROM `coupon_prices`

  def show
    @coupon_price = CouponPrice.find(params[:id])
---
SELECT * FROM `coupon_prices` WHERE (`coupon_prices`.`id` = 1)

  def create
    @coupon_price = CouponPrice.new(params[:coupon_price])

    respond_to do |format|
      if @coupon_price.save
---
INSERT INTO `coupon_prices` (`price`, `created_at`, `updated_at`) VALUES(10, '2010-07-15 07:01:06', '2010-07-15 07:01:06')