sodexo/app/controllers/transactions_controller.rb

  def new
    @transable = find_transable
    @coupon_prices = CouponPrice.all
---
SELECT * FROM `coupon_prices`

  def create
    @transable = find_transable
    @transaction = @transable.transactions.build
    @transaction.update_attributes( {'trdate'=>params[:transaction][:trdate], 'tramount'=>params[:transaction][:tramount] } )

    params[:transaction]['tr_detail_attributes'].each do |d|
      @transaction.tr_details.create(d)
---
INSERT INTO `tr_details` (`qty`, `coupon_price_id`, `created_at`, `updated_at`, `transaction_id`) VALUES(10, 1, '2010-07-15 13:45:17', '2010-07-15 13:45:17', 15)
INSERT INTO `transactions` (`trans_id`, `created_at`, `trdate`, `updated_at`, `tramount`, `trans_type`) VALUES(1, '2010-07-14 21:49:58', '2007-02-02', '2010-07-14 21:49:58', 25, 'Buyer')