sodexo/app/controllers/vendors_controller.rb

  def index
    @vendors = Vendor.all
---
SELECT * FROM `vendors`

  def show
    @vendor = Vendor.find(params[:id])
---
SELECT * FROM `vendors` WHERE (`vendors`.`id` = 1)

  def edit
    @vendor = Vendor.find(params[:id])
---
SELECT * FROM `vendors` WHERE (`vendors`.`id` = 1)

  def create
    @vendor = Vendor.new(params[:vendor])

    respond_to do |format|
      if @vendor.save
---
INSERT INTO `vendors` (`name`, `address`, `created_at`, `updated_at`, `phone1`, `phone2`, `isActive`) VALUES('Chandu', 'bhavani colony', '2010-07-14 17:03:57', '2010-07-14 17:03:57', '24017995', '', 1)